hbase_load_c_200000.txt
[WARN]  The 'hbase10' client has been deprecated because HBase 1.0 is EOM. If you are using HBase 1.2+ try using the 'hbase12' client instead.
java -cp /usr/local/ycsb-0.14.0/hbase10-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/protobuf-java-2.5.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-compress-1.4.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/paranamer-2.3.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/findbugs-annotations-1.3.9-1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-lang-2.6.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-httpclient-3.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jaxb-api-2.2.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/htrace-core-3.1.0-incubating.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/api-util-1.0.0-M20.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-net-3.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/log4j-1.2.17.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jcodings-1.0.8.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-codec-1.9.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-auth-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-logging-1.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-cli-1.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jetty-util-6.1.26.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/apacheds-kerberos-codec-2.0.0-M15.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-annotations-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jackson-mapper-asl-1.8.8.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/netty-all-4.0.23.Final.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/apacheds-i18n-2.0.0-M15.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/httpcore-4.2.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-math3-3.1.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-protocol-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-common-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/guava-12.0.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-el-1.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/activation-1.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-annotations-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-collections-3.2.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-mapreduce-client-core-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-yarn-common-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jsr305-1.3.9.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/slf4j-log4j12-1.7.7.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-configuration-1.6.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-beanutils-1.7.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-digester-1.8.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/avro-1.7.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/xz-1.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/snappy-java-1.0.4.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-io-2.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/joni-2.1.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-client-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase10-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/netty-3.6.2.Final.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-common-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/httpclient-4.2.5.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jsch-0.1.42.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-yarn-api-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/xmlenc-0.52.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-beanutils-core-1.8.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/api-asn1-api-1.0.0-M20.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/stax-api-1.0-2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/zookeeper-3.4.6.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.HBaseClient10 -s -P workloads/workloadc -p recordcount=200000 -p columnfamily=family -load
Command line: -db com.yahoo.ycsb.db.HBaseClient10 -s -P workloads/workloadc -p recordcount=200000 -p columnfamily=family -load
YCSB Client 0.14.0

Loading workload...
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Starting test.
2018-12-09 02:29:25:426 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-09 02:29:35:394 10 sec: 11937 operations; 1193.7 current ops/sec; est completion in 2 minutes [INSERT: Count=11937, Max=138111, Min=432, Avg=694.58, 90=756, 99=3749, 99.9=10647, 99.99=44351] 
2018-12-09 02:29:45:394 20 sec: 30479 operations; 1854.2 current ops/sec; est completion in 1 minute [INSERT: Count=18542, Max=91967, Min=400, Avg=533.19, 90=577, 99=860, 99.9=5331, 99.99=34719] 
2018-12-09 02:29:55:394 30 sec: 50505 operations; 2002.6 current ops/sec; est completion in 1 minute [INSERT: Count=20026, Max=31231, Min=382, Avg=494.59, 90=534, 99=770, 99.9=4119, 99.99=25647] 
2018-12-09 02:30:05:394 40 sec: 69873 operations; 1936.8 current ops/sec; est completion in 1 minute [INSERT: Count=19368, Max=31215, Min=377, Avg=512.09, 90=597, 99=1099, 99.9=7931, 99.99=23631] 
2018-12-09 02:30:15:394 50 sec: 91423 operations; 2155 current ops/sec; est completion in 1 minute [INSERT: Count=21550, Max=23135, Min=385, Avg=460.74, 90=472, 99=629, 99.9=5159, 99.99=17551] 
2018-12-09 02:30:25:394 60 sec: 110716 operations; 1929.3 current ops/sec; est completion in 49 seconds [INSERT: Count=19293, Max=419839, Min=378, Avg=514.58, 90=546, 99=929, 99.9=5927, 99.99=20143] 
2018-12-09 02:30:35:394 70 sec: 130787 operations; 2007.1 current ops/sec; est completion in 38 seconds [INSERT: Count=20071, Max=21311, Min=384, Avg=495.12, 90=533, 99=785, 99.9=5123, 99.99=18879] 
2018-12-09 02:30:45:394 80 sec: 151534 operations; 2074.7 current ops/sec; est completion in 26 seconds [INSERT: Count=20747, Max=68927, Min=365, Avg=479.05, 90=489, 99=675, 99.9=4575, 99.99=24063] 
2018-12-09 02:30:55:394 90 sec: 171054 operations; 1952 current ops/sec; est completion in 16 seconds [INSERT: Count=19520, Max=29519, Min=374, Avg=506.98, 90=561, 99=969, 99.9=6923, 99.99=24271] 
2018-12-09 02:31:05:394 100 sec: 187844 operations; 1679 current ops/sec; est completion in 7 second [INSERT: Count=16790, Max=81919, Min=380, Avg=594.47, 90=686, 99=1861, 99.9=13775, 99.99=32367] 
2018-12-09 02:31:12:589 107 sec: 200000 operations; 1689.74 current ops/sec; [CLEANUP: Count=2, Max=911359, Min=13, Avg=455558.5, 90=911359, 99=911359, 99.9=911359, 99.99=911359] [INSERT: Count=12156, Max=31919, Min=369, Avg=513.64, 90=577, 99=1338, 99.9=9223, 99.99=22671] 
[OVERALL], RunTime(ms), 107194
[OVERALL], Throughput(ops/sec), 1865.776069556132
[TOTAL_GCS_PS_Scavenge], Count, 144
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 398
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.37128943784167023
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 144
[TOTAL_GC_TIME], Time(ms), 398
[TOTAL_GC_TIME_%], Time(%), 0.37128943784167023
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 455558.5
[CLEANUP], MinLatency(us), 13
[CLEANUP], MaxLatency(us), 911359
[CLEANUP], 95thPercentileLatency(us), 911359
[CLEANUP], 99thPercentileLatency(us), 911359
[INSERT], Operations, 200000
[INSERT], AverageLatency(us), 519.271725
[INSERT], MinLatency(us), 365
[INSERT], MaxLatency(us), 419839
[INSERT], 95thPercentileLatency(us), 648
[INSERT], 99thPercentileLatency(us), 1087
[INSERT], Return=OK, 200000
[WARN]  The 'hbase10' client has been deprecated because HBase 1.0 is EOM. If you are using HBase 1.2+ try using the 'hbase12' client instead.
java -cp /usr/local/ycsb-0.14.0/hbase10-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/protobuf-java-2.5.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-compress-1.4.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/paranamer-2.3.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/findbugs-annotations-1.3.9-1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-lang-2.6.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-httpclient-3.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jaxb-api-2.2.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/htrace-core-3.1.0-incubating.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/api-util-1.0.0-M20.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-net-3.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/log4j-1.2.17.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jcodings-1.0.8.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-codec-1.9.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-auth-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-logging-1.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-cli-1.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jetty-util-6.1.26.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/apacheds-kerberos-codec-2.0.0-M15.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-annotations-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jackson-mapper-asl-1.8.8.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/netty-all-4.0.23.Final.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/apacheds-i18n-2.0.0-M15.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/httpcore-4.2.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-math3-3.1.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-protocol-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-common-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/guava-12.0.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-el-1.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/activation-1.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-annotations-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-collections-3.2.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-mapreduce-client-core-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-yarn-common-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jsr305-1.3.9.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/slf4j-log4j12-1.7.7.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-configuration-1.6.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-beanutils-1.7.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-digester-1.8.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/avro-1.7.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/xz-1.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/snappy-java-1.0.4.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-io-2.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/joni-2.1.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-client-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase10-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/netty-3.6.2.Final.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-common-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/httpclient-4.2.5.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jsch-0.1.42.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-yarn-api-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/xmlenc-0.52.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-beanutils-core-1.8.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/api-asn1-api-1.0.0-M20.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/stax-api-1.0-2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/zookeeper-3.4.6.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.HBaseClient10 -s -P workloads/workloadc -p recordcount=200000 -p columnfamily=family -load
Command line: -db com.yahoo.ycsb.db.HBaseClient10 -s -P workloads/workloadc -p recordcount=200000 -p columnfamily=family -load
YCSB Client 0.14.0

Loading workload...
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Starting test.
2018-12-09 04:28:34:400 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-09 04:28:44:365 10 sec: 11337 operations; 1133.59 current ops/sec; est completion in 2 minutes [INSERT: Count=11337, Max=101887, Min=411, Avg=698.8, 90=763, 99=3249, 99.9=9591, 99.99=47775] 
2018-12-09 04:28:54:365 20 sec: 28937 operations; 1760.18 current ops/sec; est completion in 1 minute [INSERT: Count=17600, Max=430335, Min=343, Avg=561.78, 90=606, 99=937, 99.9=6331, 99.99=34367] 
2018-12-09 04:29:04:365 30 sec: 49717 operations; 2078 current ops/sec; est completion in 1 minute [INSERT: Count=20780, Max=25519, Min=376, Avg=477.04, 90=506, 99=688, 99.9=3697, 99.99=23887] 
2018-12-09 04:29:14:365 40 sec: 65912 operations; 1619.34 current ops/sec; est completion in 1 minute [INSERT: Count=16195, Max=112191, Min=391, Avg=612.54, 90=716, 99=2041, 99.9=12911, 99.99=34175] 
2018-12-09 04:29:24:365 50 sec: 81724 operations; 1581.36 current ops/sec; est completion in 1 minute [INSERT: Count=15812, Max=43007, Min=349, Avg=628.28, 90=775, 99=2445, 99.9=9991, 99.99=27295] 
2018-12-09 04:29:34:365 60 sec: 102299 operations; 2057.5 current ops/sec; est completion in 58 seconds [INSERT: Count=20622, Max=22463, Min=350, Avg=481.99, 90=524, 99=851, 99.9=5183, 99.99=18655] 
2018-12-09 04:29:44:365 70 sec: 121193 operations; 1889.21 current ops/sec; est completion in 46 seconds [INSERT: Count=18847, Max=51167, Min=359, Avg=525.38, 90=624, 99=998, 99.9=5223, 99.99=23023] 
2018-12-09 04:29:54:365 80 sec: 141583 operations; 2039 current ops/sec; est completion in 34 seconds [INSERT: Count=20390, Max=20511, Min=363, Avg=486.88, 90=521, 99=813, 99.9=3923, 99.99=18639] 
2018-12-09 04:30:04:365 90 sec: 161847 operations; 2026.4 current ops/sec; est completion in 22 seconds [INSERT: Count=20264, Max=23871, Min=379, Avg=490.03, 90=510, 99=780, 99.9=4711, 99.99=20415] 
2018-12-09 04:30:14:365 100 sec: 178454 operations; 1660.7 current ops/sec; est completion in 13 seconds [INSERT: Count=16607, Max=1070079, Min=393, Avg=598.05, 90=621, 99=1133, 99.9=10135, 99.99=32143] 
2018-12-09 04:30:24:305 109 sec: 200000 operations; 2167.61 current ops/sec; [CLEANUP: Count=2, Max=154239, Min=13, Avg=77094.5, 90=154239, 99=154239, 99.9=154239, 99.99=154239] [INSERT: Count=21546, Max=18719, Min=366, Avg=450.7, 90=461, 99=708, 99.9=3789, 99.99=16703] 
[OVERALL], RunTime(ms), 109941
[OVERALL], Throughput(ops/sec), 1819.1575481394566
[TOTAL_GCS_PS_Scavenge], Count, 151
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 334
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.30379931053928927
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 151
[TOTAL_GC_TIME], Time(ms), 334
[TOTAL_GC_TIME_%], Time(%), 0.30379931053928927
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 77094.5
[CLEANUP], MinLatency(us), 13
[CLEANUP], MaxLatency(us), 154239
[CLEANUP], 95thPercentileLatency(us), 154239
[CLEANUP], 99thPercentileLatency(us), 154239
[INSERT], Operations, 200000
[INSERT], AverageLatency(us), 534.59228
[INSERT], MinLatency(us), 343
[INSERT], MaxLatency(us), 1070079
[INSERT], 95thPercentileLatency(us), 704
[INSERT], 99thPercentileLatency(us), 1179
[INSERT], Return=OK, 200000